wolfSSL/wolfip/src/port/rp2350_cyw43439/cyw43439_driver.c
/* cyw43439_driver.c - clean-room CYW43439 host driver
 *
 * Copyright (C) 2026 wolfSSL Inc.
 *
 * This file is part of wolfIP TCP/IP stack.
 *
 * wolfIP is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 3 of the License, or
 * (at your option) any later version.
 *
 * =============================================================
 * Bring-up sequence (CYW43439 datasheet + PicoWi reversing notes)
 * =============================================================
 *
 *   1. Assert WL_REG_ON; hold DATA2 low (not present on Pico 2 W
 *      carrier - the strap is fixed at silicon, gSPI mode is the only
 *      option) and wait >= 4.5 ms for the chip's POR sequence.
 *
 *   2. Poll the gSPI test register at F0/0x14 for the value
 *      0xFEEDBEAD (chip alive + ALP clock running). Time out after
 *      ~50 ms.
 *
 *   3. Configure the gSPI bus: 32-bit word size, little-endian, high-
 *      speed mode (CHIP_CLOCK_CSR = ALP_AVAIL | FORCE_ALP). Switch to
 *      higher clock once HT_AVAIL is set.
 *
 *   4. Enable F1 backplane access; raise the backplane window to the
 *      ARM's SRAM region (~ 0x00000000 on-chip, separate address space
 *      from the host XIP).
 *
 *   5. Push the firmware blob (~225 KB) byte-stream into the ARM's
 *      SRAM via F1 sliding-window writes. Append the NVRAM tail
 *      (typically ~1 KB of board params) and the CLM regional blob
 *      (~7 KB).
 *
 *   6. Write the reset vector to SBSDIO_FUNC1_SBADDRLOW (low PC bits)
 *      and SBADDRHIGH. Deassert the ARM reset by clearing
 *      SICF_CPUHALT and setting SICF_CLOCK_EN | SICF_FGC in the AI
 *      IOCTRL register at backplane 0x18000644 (ARM core).
 *
 *   7. Poll the firmware ready flag at the well-known F1 sentinel
 *      until ARM_RUNNING. The firmware now drives the gSPI host
 *      interface; further communication is SDPCM-framed.
 *
 *   8. Subscribe to the F2 data channel (issue an SDPCM "subscribe"
 *      ioctl) and start polling DATA_RDY for inbound events.
 *
 * SDPCM frame format (channel field selects sub-protocol):
 *
 *   +0 : length (LE u16; total bytes from start of header)
 *   +2 : length-XOR (~length, sanity check)
 *   +4 : sequence (u8, incremented each TX)
 *   +5 : channel (0 = control/ioctl, 1 = event, 2 = data)
 *   +6 : next-len (u8, flow control)
 *   +7 : header-len (u8, typically 12)
 *   +8 : padding (typically 0)
 *
 * After SDPCM there is a per-channel sub-header:
 *   ioctl  -> CDC header (cmd / flags / id / len / status, 16 bytes)
 *   data   -> BDC header (flags / priority / flags2 / data-offset,
 *             4 bytes; followed by 802.3 frame)
 *   event  -> BDC + WLC event hdr
 *
 * The WLC ioctl command numbers and the wpa_auth / wsec / event-mask /
 * BDC / wl_wsec_key constants used by the data path are #defined below;
 * the country code is set via the "country" iovar (WLC_SET_VAR), not a
 * dedicated ioctl.
 *
 * EAPOL TX: BDC frame on channel 2 with ethertype 0x888E in the body.
 * EAPOL RX: dispatched by frame type from the BDC inbound queue.
 *
 * Hardware-proven: the control plane (gSPI -> backplane -> ALP ->
 * firmware download -> SDPCM/CDC ioctl -> WLC_UP + MAC read) and the
 * join + event-driven assoc state (cyw43_connect associates to a real
 * AP; cyw43_poll decodes WLC_E_LINK up/down). Still untested on silicon:
 * the 4-way EAPOL data path + WLC_SET_KEY, which need the wolfIP
 * supplicant linked in (WOLFIP_WITH_SUPPLICANT).
 */
#include <string.h>
#include <stdio.h>

#include "cyw43439_driver.h"
#include "cyw43_sdpcm.h"
#include "rp2350_spi.h"
#include "rp2350_pio.h"
#include "cyw43439_fw.h"

/* DEBUG_BRINGUP (default 1) is defined in cyw43439_driver.h. When 0 the
 * progress logging below - calls and format strings - is compiled out. */
#if DEBUG_BRINGUP
#define BRINGUP_LOG(...) printf(__VA_ARGS__)
#else
#define BRINGUP_LOG(...) do { } while (0)
#endif

/* gSPI command frame layout - 32-bit command word.
 *   bit 31    : direction      (0 = read, 1 = write)
 *   bit 30    : auto-increment (1 = yes for multi-word access)
 *   bits 29:28: function       (0 = F0/bus, 1 = F1/backplane, 2 = F2/data)
 *   bits 27:11: address        (17-bit byte address)
 *   bits 10:0 : length         (bytes, up to 2047)
 */
#define GSPI_CMD_WRITE          (1U << 31)
#define GSPI_CMD_INC            (1U << 30)
#define GSPI_CMD_FUNC(f)        ((uint32_t)((f) & 3U) << 28)
#define GSPI_CMD_ADDR(a)        ((uint32_t)((a) & 0x1FFFFU) << 11)
#define GSPI_CMD_LEN(n)         ((uint32_t)((n) & 0x7FFU))

/* F0 (bus) registers. */
#define GSPI_F0_BUS_CTRL        0x0000U
#define GSPI_F0_RESPONSE_DELAY  0x0001U
#define GSPI_F0_BUS_TEST        0x0014U     /* expect 0xFEEDBEAD          */

/* SPI_BUS_CONTROL (F0 0x0000) field bits. */
#define BUS_WORD_LENGTH_32      (1U << 0)
#define BUS_ENDIAN_BIG          (1U << 1)
#define BUS_CLOCK_PHASE         (1U << 2)
#define BUS_CLOCK_POLARITY      (1U << 3)
#define BUS_HIGH_SPEED          (1U << 4)
#define BUS_INT_POLARITY_HIGH   (1U << 5)
#define BUS_WAKE_UP             (1U << 7)

#define GSPI_TEST_PATTERN       0xFEEDBEADU

/* Functions. */
#define GSPI_FUNC_BUS           0U          /* F0 - SPI bus registers     */
#define GSPI_FUNC_BACKPLANE     1U          /* F1 - chip backplane        */
#define GSPI_FUNC_WLAN          2U          /* F2 - WLAN data             */

/* F0 register: per-function read response delay (bytes). */
#define SPI_RESP_DELAY_F1       0x1DU       /* F0 */
#define F1_READ_PAD_BYTES       16U         /* delay we configure for F1 */

/* F1 (backplane) window-control + clock registers (direct F1 addresses,
 * accessed without the backplane window). */
#define SBSDIO_FUNC1_SBADDRLOW  0x1000AU    /* 3 consecutive bytes set the */
#define SBSDIO_FUNC1_SBADDRMID  0x1000BU    /* backplane address window     */
#define SBSDIO_FUNC1_SBADDRHIGH 0x1000CU
#define CHIP_CLOCK_CSR          0x1000EU
#define CLOCK_CSR_ALP_REQ       0x08U
#define CLOCK_CSR_HT_REQ        0x10U
#define CLOCK_CSR_ALP_AVAIL     0x40U
#define CLOCK_CSR_HT_AVAIL      0x80U

/* Backplane addressing. The low 15 bits index within a 32 KB window; the
 * upper bits select the window via the SBADDR registers. Backplane
 * memory accesses OR the 4-byte-access flag into the in-window address. */
#define BACKPLANE_WINDOW_MASK   0x7FFFU
#define SB_ACCESS_4B_FLAG       0x8000U
#define CHIPCOMMON_BASE         0x18000000U
#define CYW43_CHIP_ID           0xA9A6U      /* 43439 ChipCommon id field  */

/* Internal core wrappers (AI) for the firmware download / launch. */
#define WRAPPER_OFFSET          0x00100000U
#define WLAN_ARMCM3_BASE        0x18003000U
#define SOCSRAM_BASE            0x18004000U
#define WLAN_ARM_WRAPPER        (WLAN_ARMCM3_BASE + WRAPPER_OFFSET) /* 0x18103000 */
#define SOCSRAM_WRAPPER         (SOCSRAM_BASE + WRAPPER_OFFSET)     /* 0x18104000 */
#define AI_IOCTRL_OFFSET        0x408U
#define AI_RESETCTRL_OFFSET     0x800U
#define SICF_CLOCK_EN           0x01U
#define SICF_FGC                0x02U
#define SICF_CPUHALT            0x20U
#define AIRC_RESET              0x01U
#define SOCSRAM_BANKX_INDEX     (SOCSRAM_BASE + 0x10U)   /* = 0x18004010 */
#define SOCSRAM_BANKX_PDA       (SOCSRAM_BASE + 0x44U)   /* = 0x18004044 */

/* SDIO core + chip-clock readiness during launch. */
#define SDIO_BASE               0x18002000U
#define SDIO_INT_HOST_MASK      (SDIO_BASE + 0x24U)
#define I_HMB_SW_MASK           0x000000F0U
#define SDIO_FUNCTION2_WATERMARK 0x10008U   /* F1 */
#define SPI_F2_WATERMARK        32U
#define SPI_STATUS_REGISTER     0x08U       /* F0 */
#define STATUS_F2_RX_READY      0x20U

#define CYW43_RAM_SIZE          0x80000U    /* 512 KB chip RAM */
#define CYW43_FW_CHUNK          64U

/* F2 (WLAN data) packet transport + SDPCM/CDC ioctl framing. */
#define STATUS_F2_PKT_AVAILABLE 0x00000100U
#define STATUS_F2_PKT_LEN_MASK  0x000FFE00U
#define STATUS_F2_PKT_LEN_SHIFT 9U
#define SPI_FRAME_CONTROL       0x1000DU    /* F1 backplane: 0x1000x range */
/* gSPI F0 interrupt register: 16-bit, write-1-to-clear. The firmware gates
 * the F2 RX path until latched FIFO error bits are acknowledged, so an
 * unacked overflow during an inbound burst stalls RX permanently. */
#define SPI_INTERRUPT_REGISTER  0x04U       /* F0, 2 bytes, W1C */
#define SPI_INTERRUPT_ENABLE    0x06U       /* F0, 2 bytes */
#define SPI_INT_DATA_UNAVAIL    0x0001U
#define SPI_INT_F2F3_UNDERFLOW  0x0002U
#define SPI_INT_F2F3_OVERFLOW   0x0004U
#define SPI_INT_COMMAND_ERROR   0x0008U
#define SPI_INT_DATA_ERROR      0x0010U
#define SPI_INT_F2_PKT_AVAIL    0x0020U
#define SPI_INT_F1_OVERFLOW     0x0080U
#define SPI_INT_ERROR_BITS      (SPI_INT_DATA_UNAVAIL | SPI_INT_F2F3_UNDERFLOW \
                                 | SPI_INT_F2F3_OVERFLOW | SPI_INT_COMMAND_ERROR \
                                 | SPI_INT_DATA_ERROR | SPI_INT_F1_OVERFLOW)
/* Interrupt-enable mask written to 0x06 at init (= 0x00BE, the WHD/cyw43
 * value). The firmware only keeps re-asserting F2_PACKET_AVAILABLE in the
 * status word while F2 + its error bits are enabled here; without this the
 * F2 RX path stops flagging packets after the first FIFO error and stalls
 * permanently. */
#define SPI_INT_ENABLE_MASK     (SPI_INT_F2F3_UNDERFLOW | SPI_INT_F2F3_OVERFLOW \
                                 | SPI_INT_COMMAND_ERROR | SPI_INT_DATA_ERROR \
                                 | SPI_INT_F2_PKT_AVAIL | SPI_INT_F1_OVERFLOW)
#define SDPCM_CHAN_CONTROL      0U
#define SDPCM_CHAN_EVENT        1U
#define SDPCM_CHAN_DATA         2U
#define CDC_KIND_GET            0U
#define CDC_KIND_SET            2U
#define WLC_UP                  2U
#define WLC_DOWN                3U        /* take the MAC down for reconfig  */
#define WLC_GET_VAR             262U
#define WLC_SET_VAR             263U
#define CYW43_IOBUF_SZ          2048U

/* WLC ioctl command IDs used by the join / data path. Clean-room: these
 * are numeric command numbers of the CYW43xxx "wl" ioctl interface,
 * cross-checked across brcmfmac / WHD / cyw43-driver. */
#define WLC_SET_INFRA           20U
#define WLC_SET_AUTH            22U
#define WLC_SET_SSID            26U
#define WLC_SET_KEY             45U
#define WLC_DISASSOC            52U
#define WLC_SET_WSEC            134U
#define WLC_SET_WPA_AUTH        165U
#define WLC_SET_WSEC_PMK        268U      /* push passphrase/PMK to firmware */
#define WLC_SET_PM              86U       /* power-management mode (0=CAM)   */
#define WLC_PM_OFF              0U        /* constantly awake (no sleep)     */
#define WSEC_PASSPHRASE         0x0001U   /* wsec_pmk_t flags: key is a passphrase */

/* wpa_auth (WLC_SET_WPA_AUTH), wsec (WLC_SET_WSEC), infra + auth values. */
#define WPA_AUTH_DISABLED       0x0000U
#define WPA2_AUTH_PSK           0x0080U
#define WSEC_NONE               0x0000U
#define WSEC_AES_ENABLED        0x0004U   /* CCMP */
#define INFRA_INFRASTRUCTURE    1U
#define AUTH_OPEN               0U

