wolfSSL/wolfip/src/port/rp2350_cyw43439/cyw43439_driver.c
/* Async event indices (WLC_E_*) + the event_msgs subscription mask. */
#define WLC_E_SET_SSID          0U
#define WLC_E_AUTH              3U
#define WLC_E_DEAUTH            5U
#define WLC_E_DEAUTH_IND        6U
#define WLC_E_ASSOC             7U
#define WLC_E_DISASSOC          11U
#define WLC_E_DISASSOC_IND      12U
#define WLC_E_LINK              16U
#define WLC_E_PSK_SUP           46U
#define WL_EVENTING_MASK_LEN    16U
#define WLC_E_STATUS_SUCCESS    0U
#define WLC_EVENT_MSG_LINK      0x01U     /* WLC_E_LINK flags: link up */
/* WLC_E_PSK_SUP status (supplicant state): the firmware's 4-way handshake
 * is fully complete and the link is encrypted only at WLC_SUP_KEYED. This
 * is the canonical "you may send data / start DHCP" trigger on a secured
 * FullMAC join - WLC_E_ASSOC (associated) and WLC_E_LINK (link up) both
 * fire while the port is still unkeyed. Wire value is 6 (cyw43-driver
 * CYW43_SUP_KEYED, brcmfmac FWSUP_COMPLETED; WHD's 262 is a host-side
 * +256 bias only, not on the wire). */
#define WLC_SUP_KEYED           6U

/* BDC (data-channel) 4-byte header. Protocol version 2 sits in the high
 * nibble of the flags byte; data_offset is in units of 4 bytes. */
#define BDC_PROTO_VER           2U
#define BDC_FLAG_VER            (BDC_PROTO_VER << 4)   /* 0x20 */

/* wl_wsec_key (WLC_SET_KEY) - 160-byte struct, selected field offsets. */
#define WSEC_KEY_STRUCT_SZ      160U
#define WSEC_KEY_OFF_INDEX      0U
#define WSEC_KEY_OFF_LEN        4U
#define WSEC_KEY_OFF_DATA       8U
#define WSEC_KEY_OFF_ALGO       112U
#define WSEC_KEY_OFF_FLAGS      116U
#define WSEC_KEY_OFF_EA         154U
#define CRYPTO_ALGO_AES_CCM     4U
#define WL_PRIMARY_KEY          2U        /* pairwise / primary key flag */

#define ETHERTYPE_EAPOL         0x888EU
#define WLC_SSID_STRUCT_SZ      36U       /* u32 len + 32-byte SSID */

/* Driver state. Small enough to keep on .bss. */
static struct cyw43_state {
    cyw43_eapol_cb_t eapol_cb;
    cyw43_data_cb_t  data_cb;
    void            *cb_ctx;
    uint8_t          mac[6];     /* our STA MAC                          */
    uint8_t          bssid[6];   /* associated AP MAC (EAPOL dst)        */
    uint8_t          tx_seq;
    int              ready;
    int              assoc_up;   /* current link state (up/down)         */
    int              assoc_seen; /* latched: link came up at least once  */
    int              keyed;      /* 4-way complete (WLC_SUP_KEYED)        */
    uint32_t         rx_count;   /* inbound data frames (liveness)        */
    uint32_t         bus_test;      /* F0 0x14 read after 32-bit config */
    uint32_t         bus_test_pre;  /* F0 0x14 read in initial swap mode */
    uint32_t         chip_id;       /* ChipCommon id (diagnostics)      */
    uint32_t         cur_window;    /* cached backplane window          */
    uint32_t         alp_csr;       /* last clock-CSR read (diagnostics)*/
    int              alp_ok;        /* ALP clock available              */
} g_cyw43;

void cyw43_set_rx_callbacks(cyw43_eapol_cb_t eapol_cb,
                            cyw43_data_cb_t  data_cb,
                            void *ctx)
{
    g_cyw43.eapol_cb = eapol_cb;
    g_cyw43.data_cb  = data_cb;
    g_cyw43.cb_ctx   = ctx;
}

/* ---- gSPI register access ----------------------------------------- *
 *
 * gSPI command word (32-bit, clocked MSB first):
 *   [31]    rw          1 = write, 0 = read
 *   [30]    increment   1 = address auto-increments across the burst
 *   [29:28] function    0 = F0 bus, 1 = F1 backplane, 2 = F2 WLAN
 *   [27:11] address     17-bit byte address
 *   [10:0]  length      byte count (1..2047)
 *
 * After WL_REG_ON the chip's gSPI comes up in 16-bit word mode with the
 * two 16-bit halves of every 32-bit quantity swapped on the wire. We use
 * the *_swap helpers to talk to it in that state just long enough to
 * write SPI_BUS_CONTROL (selecting 32-bit big-endian, high-speed), after
 * which the plain (non-swapped) helpers are correct.
 */

/* Reset-state byte order: the gSPI powers up in 16-bit mode. Sending the
 * 32-bit command MSB-first with its two 16-bit halves swapped puts the
 * documented wire byte order on the line (for cmd 0x4000A004 -> wire
 * A0 04 40 00, matching the PicoWi/cyw43-driver reference). Self-inverse,
 * so the same transform reassembles the readback. */
static uint32_t swap_le16(uint32_t w)
{
    return (w << 16) | (w >> 16);
}

/* Coarse busy-wait between test-register retries. clk_sys is pinned to
 * a known 12 MHz, so ~3M iterations ~= 1 s. */
static void busy_loop(uint32_t n)
{
    volatile uint32_t i = n;
    while (i-- != 0U) { __asm volatile("nop"); }
}

/* Build a gSPI command word. Auto-increment is always set (every access
 * in this driver is a burst). write != 0 sets the direction bit; fn picks
 * F0/F1/F2; addr is the 17-bit byte address; nbytes the burst length. */
static uint32_t gspi_cmd(int write, uint32_t fn, uint32_t addr,
                         uint32_t nbytes)
{
    return cyw43_gspi_cmd(write, fn, addr, nbytes);
}

/* Read a 32-bit register over PIO in the reset-state swapped byte order:
 * the command and the returned word both use the 16-bit-half swap. CS is
 * framed around the single PIO transaction. */
static uint32_t gspi_read32_swap(uint32_t fn, uint32_t addr)
{
    uint32_t cmd = gspi_cmd(0, fn, addr, 4U);
    uint32_t val;
    rp2350_spi_cs(1);
    val = rp2350_pio_xfer32(swap_le16(cmd), 32U, 32U);
    rp2350_spi_cs(0);
    return swap_le16(val);
}

/* Full 32-bit byte reverse. SPI_BUS_CONTROL selects 32-bit LITTLE-endian
 * mode, so once switched, the command and the returned word both go on
 * the wire LSB-byte-first - i.e. byte-reversed from our native MSB-first
 * PIO shift. (The ENDIAN bit, despite the "BIG" name, selects little.) */
static uint32_t bswap32(uint32_t w)
{
    return ((w & 0x000000FFU) << 24) | ((w & 0x0000FF00U) << 8)
         | ((w & 0x00FF0000U) >> 8)  | ((w & 0xFF000000U) >> 24);
}

/* 32-bit-mode read (after SPI_BUS_CONTROL has been written). */
static uint32_t gspi_read32(uint32_t fn, uint32_t addr)
{
    uint32_t cmd = gspi_cmd(0, fn, addr, 4U);
    uint32_t val;
    rp2350_spi_cs(1);
    val = rp2350_pio_xfer32(bswap32(cmd), 32U, 32U);
    rp2350_spi_cs(0);
    return bswap32(val);
}

/* Write a 32-bit register over PIO in the reset-state swapped byte order:
 * 64 bits out (swapped command then swapped value), then 32 dummy in-bits
 * to keep the RX FIFO balanced (the chip drives nothing on a write). */
static void gspi_write32_swap(uint32_t fn, uint32_t addr, uint32_t val)
{
    uint32_t cmd = gspi_cmd(1, fn, addr, 4U);
    uint32_t out[2];
    out[0] = swap_le16(cmd);
    out[1] = swap_le16(val);
    rp2350_spi_cs(1);
    (void)rp2350_pio_xfer(out, 2U, 64U, 32U);
    rp2350_spi_cs(0);
}

/* Bring the gSPI bus up via PIO and confirm the link by reading the test
 * register (0xFEEDBEAD) in the reset-state swapped mode, with retries
 * (the first read after power-up routinely fails while the chip settles).
 * Returns 0 on success. The 32-bit-mode bus-control write + bulk
 * transfers come next (they need multi-word PIO output); reading the
 * test register needs only this swapped read. */
static int gspi_bus_init(void)
{
    int tries;

