wolfSSL/wolfip/src/port/rp2350_cyw43439/cyw43439_driver.c
    /* SPI_BUS_CONTROL value that selects 32-bit / high-speed mode:
     * byte0 0xB3 (WORD_LENGTH_32|ENDIAN|HIGH_SPEED|INT_POL_HIGH|WAKE_UP)
     * + INTR_WITH_STATUS in the status byte (offset 0x02) = 0x000200B3. */
    uint32_t ctrl = BUS_WORD_LENGTH_32 | BUS_ENDIAN_BIG | BUS_HIGH_SPEED
                  | BUS_INT_POLARITY_HIGH | BUS_WAKE_UP | (0x02U << 16);

    g_cyw43.bus_test_pre = 0;
    for (tries = 0; tries < 64; tries++) {
        g_cyw43.bus_test_pre =
            gspi_read32_swap(GSPI_FUNC_BUS, GSPI_F0_BUS_TEST);
        if (g_cyw43.bus_test_pre == GSPI_TEST_PATTERN) {
            break;
        }
        busy_loop(60000U);           /* ~20 ms gap between attempts */
    }
    if (g_cyw43.bus_test_pre != GSPI_TEST_PATTERN) {
        g_cyw43.bus_test = 0;
        return -1;                   /* no link */
    }

    /* Switch to 32-bit mode (write is done in the still-swapped order),
     * then confirm with a PLAIN (unswapped) test-register read. A
     * 0xFEEDBEAD here proves the bus-control write landed and we are now
     * in 32-bit mode - the gateway to backplane + firmware load. */
    gspi_write32_swap(GSPI_FUNC_BUS, GSPI_F0_BUS_CTRL, ctrl);
    g_cyw43.bus_test = gspi_read32(GSPI_FUNC_BUS, GSPI_F0_BUS_TEST);
    return (g_cyw43.bus_test == GSPI_TEST_PATTERN) ? 0 : -1;
}

uint32_t cyw43_last_bus_test(void)     { return g_cyw43.bus_test; }
uint32_t cyw43_last_bus_test_pre(void) { return g_cyw43.bus_test_pre; }
uint32_t cyw43_last_chip_id(void)      { return g_cyw43.chip_id; }
int      cyw43_last_alp_ok(void)       { return g_cyw43.alp_ok; }
uint32_t cyw43_last_alp_csr(void)      { return g_cyw43.alp_csr; }

/* ---- 32-bit-mode register + backplane access ---------------------- *
 *
 * In 32-bit little-endian mode the command and data go on the wire LSB
 * byte first, which is byte-reversed from our native MSB-first PIO shift,
 * so we bswap32 both. A write of N(<=4) bytes packs the bytes with byte0
 * (lowest address) in bits[7:0] of `val`; bswap32 then places byte0 in
 * the MSB position so PIO sends it first. F1 (backplane) reads need a
 * 16-byte response pad (SPI_RESP_DELAY_F1); F0 reads need none.
 */

/* Direct register write of nbytes (1..4) to function fn at addr. The
 * command length is the real byte count, but we always clock a full
 * 32-bit data word (out_bits = 64, a multiple of 32 - required by the
 * PIO transport). The chip writes only `nbytes` and ignores the extra
 * clocked bytes (same as cyw43-driver's 4-byte alignment). */
static void gspi_reg_write(uint32_t fn, uint32_t addr, uint32_t val,
                           uint32_t nbytes)
{
    uint32_t cmd = gspi_cmd(1, fn, addr, nbytes);
    uint32_t out[2];
    out[0] = bswap32(cmd);
    out[1] = bswap32(val);
    rp2350_spi_cs(1);
    (void)rp2350_pio_xfer(out, 2U, 64U, 32U);
    rp2350_spi_cs(0);
}

/* Direct 4-byte register read from function fn at addr, with `pad_bytes`
 * of read turnaround (0 for F0/F2, F1_READ_PAD_BYTES for F1). Returns the
 * 32-bit value (LE: byte at addr in bits[7:0]). */
static uint32_t gspi_reg_read(uint32_t fn, uint32_t addr, uint32_t pad_bytes)
{
    uint32_t cmd = gspi_cmd(0, fn, addr, 4U);
    uint32_t cmd_w = bswap32(cmd);
    uint32_t val;
    rp2350_spi_cs(1);
    /* Clock pad bytes then 4 data bytes; the PIO returns the last word. */
    val = rp2350_pio_xfer(&cmd_w, 1U, 32U, (pad_bytes + 4U) * 8U);
    rp2350_spi_cs(0);
    return bswap32(val);
}

/* Read the F0 SPI interrupt register and write back (W1C) any latched FIFO
 * or bus error bits. The chip stops asserting F2 packet-available until an
 * overflow/underflow is acknowledged this way; without it the RX path
 * wedges after a burst (the AP's frame flood) and never recovers. The
 * low 16 bits at 0x04 are the status; 0x06 (enable) is read alongside but
 * ignored. */
static void gspi_service_irq(void)
{
    uint32_t ir = gspi_reg_read(GSPI_FUNC_BUS, SPI_INTERRUPT_REGISTER, 0U)
                  & SPI_INT_ERROR_BITS;
    if (ir != 0U) {
        /* W1C-acknowledge the latched error bits. */
        gspi_reg_write(GSPI_FUNC_BUS, SPI_INTERRUPT_REGISTER, ir, 2U);
        /* On a FIFO over/underflow the in-flight F2 frame is corrupt and
         * the RX path stays gated until it is flushed. Acknowledging the
         * interrupt alone is not enough - also abort the frame (frame-
         * control bit 0), the reference recovery for a wedged F2. */
        if ((ir & (SPI_INT_F2F3_OVERFLOW | SPI_INT_F2F3_UNDERFLOW)) != 0U) {
            gspi_reg_write(GSPI_FUNC_BACKPLANE, SPI_FRAME_CONTROL, 1U, 1U);
        }
        BRINGUP_LOG("  [irq] cleared 0x%02X\n", (unsigned)ir);
    }
}

/* Point the backplane window at the 32 KB region containing `addr`. The
 * three SBADDR bytes hold addr>>8 / >>16 / >>24; written as one 3-byte
 * F1 register write. Cached to skip redundant updates. */
static void set_backplane_window(uint32_t addr)
{
    uint32_t win = addr & ~BACKPLANE_WINDOW_MASK;
    uint32_t v;
    if (win == g_cyw43.cur_window) {
        return;
    }
    v = ((addr >> 8) & 0xFFU)
      | (((addr >> 16) & 0xFFU) << 8)
      | (((addr >> 24) & 0xFFU) << 16);
    gspi_reg_write(GSPI_FUNC_BACKPLANE, SBSDIO_FUNC1_SBADDRLOW, v, 3U);
    g_cyw43.cur_window = win;
}

/* 32-bit backplane memory read/write through the window. */
static uint32_t backplane_read32(uint32_t addr)
{
    set_backplane_window(addr);
    return gspi_reg_read(GSPI_FUNC_BACKPLANE,
                         (addr & BACKPLANE_WINDOW_MASK) | SB_ACCESS_4B_FLAG,
                         F1_READ_PAD_BYTES);
}

/* Bring up backplane access + the ALP clock. Reads the ChipCommon chip
 * id (0xA9A6 for 43439) to prove the window + F1 path work, then requests
 * and waits for the ALP clock. Returns 0 on success. */
static int backplane_bringup(void)
{
    int i;

    /* Tell the chip to insert F1_READ_PAD_BYTES of response delay on F1
     * reads (must match the pad we clock in gspi_reg_read). */
    gspi_reg_write(GSPI_FUNC_BUS, SPI_RESP_DELAY_F1, F1_READ_PAD_BYTES, 1U);
    g_cyw43.cur_window = 0xFFFFFFFFU;        /* force first window write */

