wolfSSL/wolfip/src/port/rp2350_cyw43439/cyw43439_driver.c
    /* ALP clock FIRST: the backplane cores (ChipCommon etc.) are not
     * clocked - and so not readable - until ALP is available. The clock
     * CSR itself is in the always-on domain, writable/readable without
     * ALP. Request ALP and poll for availability (~10 ms). */
    BRINGUP_LOG("  [bp] resp-delay set, requesting ALP\n");
    gspi_reg_write(GSPI_FUNC_BACKPLANE, CHIP_CLOCK_CSR,
                   CLOCK_CSR_ALP_REQ, 1U);
    for (i = 0; i < 32; i++) {
        g_cyw43.alp_csr = gspi_reg_read(GSPI_FUNC_BACKPLANE, CHIP_CLOCK_CSR,
                                        F1_READ_PAD_BYTES) & 0xFFU;
        if ((g_cyw43.alp_csr & CLOCK_CSR_ALP_AVAIL) != 0U) {
            g_cyw43.alp_ok = 1;
            break;
        }
        busy_loop(60000U);
    }
    BRINGUP_LOG("  [bp] ALP csr=0x%02lX ok=%d\n",
           (unsigned long)g_cyw43.alp_csr, g_cyw43.alp_ok);

    /* ChipCommon id (now that ALP clocks the backplane) - diagnostic
     * proof that the window + F1 read path work. Not fatal. */
    g_cyw43.chip_id = backplane_read32(CHIPCOMMON_BASE) & 0xFFFFU;
    BRINGUP_LOG("  [bp] chip id=0x%04lX\n", (unsigned long)g_cyw43.chip_id);

    return g_cyw43.alp_ok ? 0 : -1;
}

/* ---- firmware download ---------------------------------------------- *
 *
 * The CYW43439 firmware/CLM/NVRAM blob is not part of this repo (third-
 * party license, RP-silicon only). These accessors are weak so the build
 * links without it; the git-ignored fw_local/cyw43_fw_blob.c provides the
 * strong versions when present. NULL => firmware download is skipped.
 */
__attribute__((weak)) const uint8_t *cyw43_blob_fw(size_t *len)
{ if (len) *len = 0; return 0; }
__attribute__((weak)) const uint8_t *cyw43_blob_clm(size_t *len)
{ if (len) *len = 0; return 0; }
__attribute__((weak)) const uint8_t *cyw43_blob_nvram(size_t *len)
{ if (len) *len = 0; return 0; }

static void backplane_write32(uint32_t addr, uint32_t val)
{
    set_backplane_window(addr);
    gspi_reg_write(GSPI_FUNC_BACKPLANE,
                   (addr & BACKPLANE_WINDOW_MASK) | SB_ACCESS_4B_FLAG,
                   val, 4U);
}

/* Write `len` bytes of `data` to backplane RAM at `addr`, in 64-byte
 * chunks. Each 4 source bytes pack big-endian into a PIO out word so the
 * PIO (MSB-first) emits them to ascending RAM addresses; the last partial
 * chunk is zero-padded to 64 bytes. */
static void bulk_backplane_write(uint32_t addr, const uint8_t *data,
                                 uint32_t len)
{
    uint32_t off;
    for (off = 0; off < len; off += CYW43_FW_CHUNK) {
        uint32_t dst = addr + off;
        uint32_t chunk = (len - off < CYW43_FW_CHUNK)
                         ? (len - off) : CYW43_FW_CHUNK;
        uint32_t out[1U + (CYW43_FW_CHUNK / 4U)];
        uint32_t cmd, w, i;
        uint8_t  b[4];
        uint32_t idx;
        set_backplane_window(dst);
        cmd = gspi_cmd(1, GSPI_FUNC_BACKPLANE,
                       (dst & BACKPLANE_WINDOW_MASK) | SB_ACCESS_4B_FLAG,
                       CYW43_FW_CHUNK);
        out[0] = bswap32(cmd);
        for (w = 0; w < CYW43_FW_CHUNK / 4U; w++) {
            for (i = 0; i < 4U; i++) {
                idx = off + w * 4U + i;
                b[i] = (idx < len && (w * 4U + i) < chunk) ? data[idx] : 0U;
            }
            out[1U + w] = ((uint32_t)b[0] << 24) | ((uint32_t)b[1] << 16)
                        | ((uint32_t)b[2] << 8)  | (uint32_t)b[3];
        }
        rp2350_spi_cs(1);
        (void)rp2350_pio_xfer(out, 1U + (CYW43_FW_CHUNK / 4U),
                              32U + CYW43_FW_CHUNK * 8U, 32U);
        rp2350_spi_cs(0);
    }
}

/* ---- AI core control ---- */

static uint32_t ai_read(uint32_t wrapper, uint32_t off)
{
    return backplane_read32(wrapper + off);
}
static void ai_write(uint32_t wrapper, uint32_t off, uint32_t val)
{
    backplane_write32(wrapper + off, val);
}

/* Put a core into reset (no-op if the device powered up already in
 * reset, which is the normal case). */
static void core_disable(uint32_t wrapper)
{
    if ((ai_read(wrapper, AI_RESETCTRL_OFFSET) & AIRC_RESET) != 0U) {
        return;                       /* already in reset */
    }
    ai_write(wrapper, AI_IOCTRL_OFFSET, SICF_FGC | SICF_CLOCK_EN);
    (void)ai_read(wrapper, AI_IOCTRL_OFFSET);
    ai_write(wrapper, AI_RESETCTRL_OFFSET, AIRC_RESET);
    (void)ai_read(wrapper, AI_RESETCTRL_OFFSET);
    ai_write(wrapper, AI_IOCTRL_OFFSET, SICF_FGC);
    (void)ai_read(wrapper, AI_IOCTRL_OFFSET);
}

/* Take a core out of reset (launches the WLAN ARM after fw load). */
static void core_reset(uint32_t wrapper)
{
    core_disable(wrapper);
    ai_write(wrapper, AI_IOCTRL_OFFSET, SICF_FGC | SICF_CLOCK_EN);
    (void)ai_read(wrapper, AI_IOCTRL_OFFSET);
    ai_write(wrapper, AI_RESETCTRL_OFFSET, 0U);
    busy_loop(60000U);                /* ~20 ms (>> 1 ms) */
    ai_write(wrapper, AI_IOCTRL_OFFSET, SICF_CLOCK_EN);
    (void)ai_read(wrapper, AI_IOCTRL_OFFSET);
    busy_loop(60000U);
}

static int core_is_up(uint32_t wrapper)
{
    if ((ai_read(wrapper, AI_IOCTRL_OFFSET) & (SICF_FGC | SICF_CLOCK_EN))
        != SICF_CLOCK_EN) {
        return 0;
    }
    return ((ai_read(wrapper, AI_RESETCTRL_OFFSET) & AIRC_RESET) == 0U) ? 1 : 0;
}

/* Download firmware + NVRAM into chip RAM and launch the WLAN ARM, then
 * wait for HT clock and F2 (WLAN data channel) ready. Returns 0 on
 * success, -2 if no firmware blob is linked in. */
static int download_firmware(void)
{
    const uint8_t *fw, *nvram;
    size_t fw_len = 0, nvram_len = 0;
    uint32_t nvram_words, nvram_dst, size_word;
    int i;

    fw    = cyw43_blob_fw(&fw_len);
    nvram = cyw43_blob_nvram(&nvram_len);
    if (fw == 0 || fw_len == 0 || nvram == 0 || nvram_len == 0) {
        return -2;                    /* blob not linked in */
    }

    BRINGUP_LOG("  [fw] cores: disabling WLAN_ARM + SOCSRAM\n");
    /* Cores into a known state before loading. */
    core_disable(WLAN_ARM_WRAPPER);
    core_disable(SOCSRAM_WRAPPER);
    core_reset(SOCSRAM_WRAPPER);
    backplane_write32(SOCSRAM_BANKX_INDEX, 0x3U);
    backplane_write32(SOCSRAM_BANKX_PDA, 0U);

    /* Firmware to RAM base 0. */
    BRINGUP_LOG("  [fw] writing %u bytes to RAM 0...\n", (unsigned)fw_len);
    bulk_backplane_write(0x0U, fw, (uint32_t)fw_len);
    BRINGUP_LOG("  [fw] firmware written, NVRAM next\n");

    /* NVRAM at the top of RAM, 4-byte aligned, followed by the size word
     * (low half = word count, high half = its 16-bit complement). */
    nvram_words = ((uint32_t)nvram_len + 3U) / 4U;
    nvram_dst   = CYW43_RAM_SIZE - 4U - nvram_words * 4U;
    bulk_backplane_write(nvram_dst, nvram, (uint32_t)nvram_len);
    size_word = ((~nvram_words & 0xFFFFU) << 16) | (nvram_words & 0xFFFFU);
    backplane_write32(CYW43_RAM_SIZE - 4U, size_word);

    /* Launch the WLAN ARM. */
    BRINGUP_LOG("  [fw] launching WLAN ARM\n");
    core_reset(WLAN_ARM_WRAPPER);
    if (!core_is_up(WLAN_ARM_WRAPPER)) {
        BRINGUP_LOG("  [fw] WLAN ARM core not up\n");
        return -1;
    }
    BRINGUP_LOG("  [fw] ARM up, waiting HT clock\n");

