wolfSSL/wolfip/src/port/rp2350_cyw43439/cyw43439_driver.c
    /* Wait for the HT clock (firmware running). */
    for (i = 0; i < 200; i++) {
        uint32_t csr = gspi_reg_read(GSPI_FUNC_BACKPLANE, CHIP_CLOCK_CSR,
                                     F1_READ_PAD_BYTES) & 0xFFU;
        if ((csr & CLOCK_CSR_HT_AVAIL) != 0U) {
            break;
        }
        busy_loop(60000U);
    }

    /* Enable host mailbox int + F2 watermark, then wait for F2 ready. */
    backplane_write32(SDIO_INT_HOST_MASK, I_HMB_SW_MASK);
    gspi_reg_write(GSPI_FUNC_BACKPLANE, SDIO_FUNCTION2_WATERMARK,
                   SPI_F2_WATERMARK, 1U);
    /* Clear any stale latched errors, then enable the SPI interrupt mask
     * (F0 0x06). Even though RX is polled, the firmware only keeps
     * re-asserting F2_PACKET_AVAILABLE while F2 + its FIFO-error bits are
     * enabled here - without it the F2 path stops flagging packets after the
     * first overflow and RX stalls permanently. */
    gspi_reg_write(GSPI_FUNC_BUS, SPI_INTERRUPT_REGISTER, SPI_INT_ERROR_BITS, 2U);
    gspi_reg_write(GSPI_FUNC_BUS, SPI_INTERRUPT_ENABLE, SPI_INT_ENABLE_MASK, 2U);
    BRINGUP_LOG("  [fw] waiting F2 ready\n");
    for (i = 0; i < 200; i++) {
        uint32_t st = gspi_reg_read(GSPI_FUNC_BUS, SPI_STATUS_REGISTER, 0U);
        if ((st & STATUS_F2_RX_READY) != 0U) {
            g_cyw43.ready = 1;
            BRINGUP_LOG("  [fw] F2 ready, status=0x%08lX\n", (unsigned long)st);
            return 0;
        }
        busy_loop(60000U);
    }
    BRINGUP_LOG("  [fw] F2 not ready (timeout)\n");
    return -1;
}

int cyw43_firmware_ready(void) { return g_cyw43.ready; }

int cyw43_init(void)
{
    g_cyw43.tx_seq = 0;
    g_cyw43.ready  = 0;
    /* SDPCM flow control (g_tx_seq/g_tx_max/g_flow_ctl) is initialised by
     * its static initialisers - one credit until the first RX. */

    /* 1. Power sequence. The CYW43439 needs a LONG settle after WL_REG_ON
     *    goes high before its gSPI core is clocked - PicoWi waits 50 ms,
     *    cyw43-driver 250 ms; too short makes the chip ignore commands.
     *    clk_sys is pinned to a known 12 MHz, so these busy_loop counts
     *    have a real duration (~4 cycles/iter -> ~3M iters ~= 1 s), and
     *    the retry loop in gspi_bus_init adds more. CS + WL_REG_ON are
     *    CPU GPIOs (rp2350_spi.c); CLK + DATA are driven by PIO. */
    rp2350_spi_init();              /* WL_REG_ON low, CS high              */
    rp2350_pio_init();              /* load PIO gSPI program on CLK/DATA   */
    busy_loop(200000U);             /* ~65 ms low settle                   */
    rp2350_cyw43_power_up();        /* WL_REG_ON high                      */
    busy_loop(4000000U);            /* ~1.3 s settle (>> 250 ms needed)    */

    /* 2. gSPI handshake over PIO: read the test register (0xFEEDBEAD) in
     *    the reset-state swapped mode, then switch to 32-bit mode. */
    if (gspi_bus_init() != 0) {
        return -1;
    }

    /* 3. Backplane access + ALP clock: prove F1 window reads work via the
     *    ChipCommon id, then bring the ALP clock up (needed to clock the
     *    backplane for the firmware download). */
    if (backplane_bringup() != 0) {
        return -1;
    }

    /* 4. Download firmware + NVRAM, launch the WLAN ARM, wait for the F2
     *    data channel. Returns -2 if no blob is linked in (the chip stays
     *    at the backplane-ready stage; ioctls/CLM/scan come next). */
    return download_firmware();
}

/* ---- SDPCM / CDC ioctl transport over F2 ---------------------------- */

static uint8_t  g_iobuf[CYW43_IOBUF_SZ];
static uint16_t g_ioctl_id;
static uint8_t  g_tx_seq;

/* Compiler-resistant zeroization for cleartext secrets (the PSK passphrase).
 * wolfCrypt's ForceZero is not linked into the non-supplicant build of this
 * port, so use a local volatile-store loop the optimizer cannot elide. */
static void cyw43_secure_zero(void *p, size_t n)
{
    volatile uint8_t *v = (volatile uint8_t *)p;
    while (n-- > 0U) {
        *v++ = 0U;
    }
}
/* SDPCM bus flow control. The firmware grants a TX window via the
 * bus_data_credit byte (SDPCM header +9) and can pause all TX via the
 * wireless_flow_control byte (+8). Init: one credit until the first RX
 * updates it. All arithmetic is modulo-256. */
static uint8_t  g_tx_max = 1U;   /* max tx_seq the firmware grants       */
static uint8_t  g_flow_ctl;      /* nonzero = firmware paused host TX     */

static void wr32le(uint8_t *p, uint32_t v)
{
    p[0] = (uint8_t)v; p[1] = (uint8_t)(v >> 8);
    p[2] = (uint8_t)(v >> 16); p[3] = (uint8_t)(v >> 24);
}
static uint32_t rd32le(const uint8_t *p)
{
    return (uint32_t)p[0] | ((uint32_t)p[1] << 8)
         | ((uint32_t)p[2] << 16) | ((uint32_t)p[3] << 24);
}
static uint16_t rd16le(const uint8_t *p)
{
    return (uint16_t)((uint16_t)p[0] | ((uint16_t)p[1] << 8));
}

/* Write the 12-byte SDPCM software header for a `total`-byte frame on
 * channel `chan`. Bytes 6 and 8..11 stay 0 (caller zeroes the buffer). */
static void sdpcm_hdr(uint8_t *buf, uint8_t chan, uint32_t total)
{
    cyw43_sdpcm_hdr(buf, chan, total, g_tx_seq);
    g_tx_seq++;
}

/* Write a buffer to F2 (padded to 4 bytes). */
static void f2_write(const uint8_t *buf, uint32_t len)
{
    uint32_t plen = (len + 3U) & ~3U;
    uint32_t cmd = gspi_cmd(1, GSPI_FUNC_WLAN, 0U, plen);
    rp2350_spi_cs(1);
    rp2350_pio_write_bytes(bswap32(cmd), buf, plen);
    rp2350_spi_cs(0);
}

/* Read `len` bytes (padded to 4) from F2 into buf. */
static void f2_read(uint8_t *buf, uint32_t len)
{
    uint32_t plen = (len + 3U) & ~3U;
    uint32_t cmd = gspi_cmd(0, GSPI_FUNC_WLAN, 0U, plen);
    rp2350_spi_cs(1);
    rp2350_pio_read_bytes(bswap32(cmd), buf, plen);
    rp2350_spi_cs(0);
}

/* ---- SDPCM bus flow control --------------------------------------- *
 * The firmware never NAKs: if the host sends past its granted TX window
 * the frame is silently dropped. So we MUST track the credit (+9) and
 * flow byte (+8) from every received SDPCM header and gate every TX. */

/* Update credit/flow from a received SDPCM header `hdr`. The credit is
 * only advanced if the jump is sane (<= 0x40) to ignore garbage. */
static void sdpcm_update_credit(const uint8_t *hdr)
{
    cyw43_sdpcm_credit_update(hdr[8], hdr[9], &g_tx_max, &g_flow_ctl);
#if DEBUG_BRINGUP
    {
        static int n;
        if (n < 16) {
            n++;
            BRINGUP_LOG("  [cr] flow=%u credit=%u tx_max=%u tx_seq=%u\n",
                        (unsigned)hdr[8], (unsigned)hdr[9],
                        (unsigned)g_tx_max, (unsigned)g_tx_seq);
        }
    }
#endif
}

/* 1 if the host may transmit now: not flow-paused and tx_seq is inside
 * the granted window (modulo-256, not wrapped negative). */
static int sdpcm_tx_ready(void)
{
    return cyw43_sdpcm_tx_ready(g_tx_max, g_tx_seq, g_flow_ctl);
}

/* Send a CDC ioctl and wait for the matching response. `data` is the
 * request payload (SET) or the var name (iovar GET) on input, and the
 * response is copied back into it (up to `len`). Returns the CDC status
 * (0 = success), or -1 on transport timeout. */
static int cyw43_ioctl(uint32_t cmd, int set, uint8_t *data, uint32_t len)
{
    uint32_t total = 12U + 16U + len;
    uint16_t id    = ++g_ioctl_id;
    uint32_t flags = ((uint32_t)id << 16) | (set ? CDC_KIND_SET : CDC_KIND_GET);
    uint32_t st, rlen, rflags, rstatus, poff, avail;
    uint16_t size, size_com;
    uint8_t  chan, hlen;
    int      i;

    if (total > CYW43_IOBUF_SZ || len > 0xFFFFU) {
        /* len > 0xFFFF would be truncated by the 16-bit CDC length field below
         * while the memcpy uses the full len; reject it (unreachable while
         * CYW43_IOBUF_SZ < 0xFFFF, but explicit for clarity). */
        return -1;
    }
    /* ioctls are not credit-gated: the join sequence fits the initial
     * window + event-driven refreshes, and gating them stalls on the
     * no-reply bsscfg sets. Only the sustained DATA path is gated. */
    memset(g_iobuf, 0, (total + 3U) & ~3U);
    sdpcm_hdr(g_iobuf, SDPCM_CHAN_CONTROL, total);
    /* CDC header. */
    wr32le(&g_iobuf[12], cmd);
    wr32le(&g_iobuf[16], len & 0xFFFFU);
    wr32le(&g_iobuf[20], flags);
    if (len) {
        memcpy(&g_iobuf[28], data, len);
    }
    f2_write(g_iobuf, total);

    /* Poll for the response. Must be generous: a too-short cap can miss a
     * slightly-delayed reply, leaving it in the F2 queue and desyncing the
     * SDPCM stream (which then wedges every later ioctl). The bsscfg sets
     * that never reply just pay this as a one-time per-call cost. */
    for (i = 0; i < 500; i++) {
        gspi_service_irq();   /* keep F2 un-gated while awaiting the reply */
        st = gspi_reg_read(GSPI_FUNC_BUS, SPI_STATUS_REGISTER, 0U);
        if (st == 0xFFFFFFFFU || (st & STATUS_F2_PKT_AVAILABLE) == 0U) {
            busy_loop(20000U);
            continue;
        }
        rlen = (st & STATUS_F2_PKT_LEN_MASK) >> STATUS_F2_PKT_LEN_SHIFT;
        if (!cyw43_sdpcm_rlen_ok(rlen, CYW43_IOBUF_SZ)) {
            /* Abort a bad frame and keep polling (same padded-length guard as
             * cyw43_poll). */
            gspi_reg_write(GSPI_FUNC_BACKPLANE, SPI_FRAME_CONTROL, 1U, 1U);
            continue;
        }
        f2_read(g_iobuf, rlen);
        size = rd16le(&g_iobuf[0]);
        size_com = rd16le(&g_iobuf[2]);
        if ((uint16_t)(size ^ size_com) != 0xFFFFU || size == 0U) {
            continue;
        }
        /* The SDPCM-declared length must not exceed the bytes actually clocked
         * into g_iobuf; otherwise the field reads/copy-back below would pick up
         * stale prior-frame residue (mirrors the guard in cyw43_poll). */
        if ((uint32_t)size > rlen) {
            continue;
        }
        sdpcm_update_credit(g_iobuf);     /* refresh TX window from RX */
        chan = g_iobuf[5] & 0x0FU;
        hlen = g_iobuf[7];
        /* Event/data packets before our response are ignored here (they
         * get dispatched once the data path lands). */
        if (chan != SDPCM_CHAN_CONTROL || (uint32_t)hlen + 16U > size) {
            busy_loop(20000U);
            continue;
        }
        rflags = rd32le(&g_iobuf[hlen + 8U]);
        rstatus = rd32le(&g_iobuf[hlen + 12U]);
        if ((uint16_t)(rflags >> 16) != id) {
            busy_loop(20000U);
            continue;
        }
        if (len) {
            poff = (uint32_t)hlen + 16U;
            avail = (size > poff) ? (size - poff) : 0U;
            memcpy(data, &g_iobuf[poff], (avail < len) ? avail : len);
        }
        return (int)rstatus;
    }
    return -1;
}

/* iovar (WLC_SET_VAR/GET_VAR) helpers. The wire payload is the NUL-
 * terminated var name followed by the value bytes. */
static int set_iovar(const char *name, const uint8_t *val, uint32_t vlen)
{
    uint8_t  buf[128];
    uint32_t outlen;
    if (cyw43_iovar_build(name, val, vlen, buf, sizeof(buf), &outlen) != 0) {
        return -1;
    }
    return cyw43_ioctl(WLC_SET_VAR, 1, buf, outlen);
}

static int set_iovar_u32(const char *name, uint32_t v)
{
    uint8_t val[4];
    wr32le(val, v);
    return set_iovar(name, val, 4U);
}

/* CLM (regulatory) blob download via the clmload iovar. 1 KB chunks with
 * BEGIN/END flags; verified through clmload_status. No-op (success) when
 * no CLM blob is linked in. */
#define CLM_FLAG_HANDLER_VER 0x1000U
#define CLM_FLAG_BEGIN       0x0002U
#define CLM_FLAG_END         0x0004U
#define CLM_CHUNK            1024U
static uint8_t g_clmbuf[CLM_CHUNK + 32U];

static int clm_load(void)
{
    size_t clm_len = 0;
    const uint8_t *clm = cyw43_blob_clm(&clm_len);
    uint32_t off, st_word;
    uint8_t  stbuf[64];
    int rc;

