wolfSSL/wolfip/src/port/rp2350_cyw43439/cyw43439_driver.c
    if (clm == 0 || clm_len == 0) {
        return 0;                       /* no CLM linked - skip */
    }
    for (off = 0; off < (uint32_t)clm_len; ) {
        uint32_t chunk = ((uint32_t)clm_len - off > CLM_CHUNK)
                         ? CLM_CHUNK : ((uint32_t)clm_len - off);
        uint16_t flag = CLM_FLAG_HANDLER_VER;
        if (off == 0U) flag |= CLM_FLAG_BEGIN;
        if (off + chunk >= (uint32_t)clm_len) flag |= CLM_FLAG_END;
        memcpy(g_clmbuf, "clmload", 8);            /* name + NUL */
        g_clmbuf[8] = (uint8_t)flag; g_clmbuf[9] = (uint8_t)(flag >> 8);
        g_clmbuf[10] = 0x02; g_clmbuf[11] = 0x00;
        wr32le(&g_clmbuf[12], chunk);
        wr32le(&g_clmbuf[16], 0U);
        memcpy(&g_clmbuf[20], clm + off, chunk);
        rc = cyw43_ioctl(WLC_SET_VAR, 1, g_clmbuf, 20U + chunk);
        if (rc != 0) return rc;
        off += chunk;
    }
    memset(stbuf, 0, sizeof(stbuf));
    memcpy(stbuf, "clmload_status", 15);
    rc = cyw43_ioctl(WLC_GET_VAR, 0, stbuf, sizeof(stbuf));
    if (rc != 0) return rc;
    st_word = rd32le(stbuf);
    return (st_word == 0U) ? 0 : -1;
}

int cyw43_wifi_up(const char *country)
{
    uint8_t     buf[64];
    uint8_t     cval[12];
    const char *cc;
    uint16_t    code;
    int         rc;

    /* CLM regulatory blob first (needed before RF operation). */
    rc = clm_load();
    BRINGUP_LOG("  [io] CLM load rc=%d\n", rc);
    if (rc != 0) {
        return -1;
    }

    /* Country code: "country" iovar = ccode(low16) + rev(-1) + ccode. */
    cc   = (country != NULL && country[0] != '\0') ? country : "XX";
    code = (uint16_t)((uint8_t)cc[0] | ((uint16_t)(uint8_t)cc[1] << 8));
    wr32le(&cval[0], code);
    wr32le(&cval[4], 0xFFFFFFFFU);
    wr32le(&cval[8], code);
    rc = set_iovar("country", cval, sizeof(cval));
    BRINGUP_LOG("  [io] set country %c%c rc=%d\n", cc[0], cc[1], rc);

    /* A couple of standard tuning iovars (best-effort). */
    (void)set_iovar_u32("bus:txglom", 0U);
    (void)set_iovar_u32("apsta", 1U);

    /* WLC_UP - bring the MAC online (no payload). */
    rc = cyw43_ioctl(WLC_UP, 1, 0, 0U);
    BRINGUP_LOG("  [io] WLC_UP rc=%d\n", rc);
    if (rc != 0) {
        return -1;
    }

    /* Read the STA MAC via the cur_etheraddr iovar to confirm the ioctl
     * round-trip works end to end. */
    memset(buf, 0, sizeof(buf));
    memcpy(buf, "cur_etheraddr", 14);     /* name + NUL */
    rc = cyw43_ioctl(WLC_GET_VAR, 0, buf, sizeof(buf));
    if (rc == 0) {
        memcpy(g_cyw43.mac, buf, 6);
        BRINGUP_LOG("  [io] MAC %02X:%02X:%02X:%02X:%02X:%02X\n",
               g_cyw43.mac[0], g_cyw43.mac[1], g_cyw43.mac[2],
               g_cyw43.mac[3], g_cyw43.mac[4], g_cyw43.mac[5]);
    }
    else {
        BRINGUP_LOG("  [io] get MAC rc=%d\n", rc);
    }
    return rc;
}

/* Set the firmware power-management mode (WLC_SET_PM). Pass WLC_PM_OFF to
 * keep the radio constantly awake (CAM) so inbound frames are delivered
 * continuously - the firmware otherwise sleeps in a power-saving mode and
 * the AP-buffered unicast trickles through erratically, which looks like an
 * intermittent RX stall. Firmware resets PM on each (re)association, so this
 * must be (re)applied AFTER the link is up. */
int cyw43_set_powersave(uint32_t pm)
{
    uint8_t buf[4];
    int     rc;
    wr32le(buf, pm);
    rc = cyw43_ioctl(WLC_SET_PM, 1, buf, sizeof(buf));
    BRINGUP_LOG("  [io] set_pm %lu rc=%d\n", (unsigned long)pm, rc);
    return rc;
}

/* ---- data path: join, EAPOL/802.3 TX, inbound poll ----------------- *
 *
 * NOTE: this whole data path is written from the clean-room protocol
 * facts but has NOT yet been exercised on silicon (the control plane up
 * through WLC_UP + MAC read is hardware-proven; the join handshake, BDC
 * framing and key install are the Monday bring-up milestone). Treat the
 * exact iovar names / event-flag handling as the first thing to probe.
 */

/* Async events we subscribe to so cyw43_poll() can track assoc state. */
static const uint8_t cyw43_event_subs[] = {
    WLC_E_SET_SSID, WLC_E_AUTH, WLC_E_DEAUTH, WLC_E_DEAUTH_IND,
    WLC_E_ASSOC, WLC_E_DISASSOC, WLC_E_DISASSOC_IND, WLC_E_LINK,
    WLC_E_PSK_SUP
};

/* Canonical WPA2-PSK / CCMP RSN information element (no MFP). Published
 * to the assoc request via the wpaie iovar. This MUST match the RSN IE
 * the wolfIP supplicant advertises (rsn_ie_build_wpa2_psk with MFP off)
 * so the AP's M3 RSN-IE comparison and the 4-way succeed; if the
 * supplicant enables MFP, the IE has to be plumbed from it instead. */
static const uint8_t cyw43_rsn_ie_wpa2_psk[] = {
    0x30, 0x14,                   /* RSN element, length 20             */
    0x01, 0x00,                   /* version 1                          */
    0x00, 0x0F, 0xAC, 0x04,       /* group cipher = CCMP                */
    0x01, 0x00,                   /* pairwise count 1                   */
    0x00, 0x0F, 0xAC, 0x04,       /* pairwise = CCMP                    */
    0x01, 0x00,                   /* AKM count 1                        */
    0x00, 0x0F, 0xAC, 0x02,       /* AKM = PSK                          */
    0x00, 0x00                    /* RSN capabilities                   */
};

/* Backing store for the 160-byte wl_wsec_key (kept off the stack). */
static uint8_t g_keybuf[WSEC_KEY_STRUCT_SZ];

/* Send a bare u32 argument to a WLC command (not an iovar). */
static int cyw43_ioctl_set_u32(uint32_t cmd, uint32_t v)
{
    uint8_t b[4];
    wr32le(b, v);
    return cyw43_ioctl(cmd, 1, b, 4U);
}

/* Build an SDPCM (data channel) + BDC frame from an optional synthetic
 * Ethernet header plus a payload, and push it on F2. */
static int bdc_data_tx(const uint8_t *eth_hdr, uint32_t hdr_len,
                       const uint8_t *payload, uint32_t pay_len)
{
    uint32_t dlen  = hdr_len + pay_len;
    uint32_t total = 12U + 4U + dlen;

    if (payload == NULL || dlen < 14U || total > CYW43_IOBUF_SZ) {
        return -1;
    }
    /* Respect the firmware TX window: if no credit, drop (the IP stack
     * retransmits). Sending past the window is silently discarded by the
     * firmware and eventually stalls the link. */
    if (!sdpcm_tx_ready()) {
        return -1;
    }
    memset(g_iobuf, 0, (total + 3U) & ~3U);
    sdpcm_hdr(g_iobuf, SDPCM_CHAN_DATA, total);
    /* BDC header (version 2; priority/ifidx/data_offset all 0). */
    g_iobuf[12] = BDC_FLAG_VER;
    if (hdr_len != 0U) {
        memcpy(&g_iobuf[16], eth_hdr, hdr_len);
    }
    memcpy(&g_iobuf[16 + hdr_len], payload, pay_len);
    /* ethertype lives at offset 12 of whichever buffer actually holds >= 14
     * bytes; guard the payload fallback so a partial synthetic header cannot
     * index past a short payload. */
    BRINGUP_LOG("  [tx] %lu bytes ethertype=0x%02X%02X\n",
                (unsigned long)(hdr_len + pay_len),
                (hdr_len >= 14U) ? eth_hdr[12]
                                 : ((pay_len >= 14U) ? payload[12] : 0U),
                (hdr_len >= 14U) ? eth_hdr[13]
                                 : ((pay_len >= 14U) ? payload[13] : 0U));
    f2_write(g_iobuf, total);
    return 0;
}

/* Decode one async event frame and update assoc state. ev points at the
 * BDC header; the Ethernet event frame follows it. */
static void cyw43_handle_event(const uint8_t *ev, uint32_t len)
{
    uint32_t bdc_off, etype, estatus;
    uint16_t eflags;
    const uint8_t *e;

    if (len < 4U) {
        return;
    }
    /* Ethernet event frame = BDC(4) + data_offset*4; wl_event_msg sits
     * 14 (Ethernet) + 10 (bcmeth) = 24 bytes into it. Big-endian fields:
     * flags@26, event_type@28, status@32, source addr@48. */
    bdc_off = 4U + ((uint32_t)ev[3] << 2);
    if (len < bdc_off + 54U) {
        return;
    }
    e = ev + bdc_off;
    eflags  = (uint16_t)(((uint16_t)e[26] << 8) | e[27]);
    etype   = ((uint32_t)e[28] << 24) | ((uint32_t)e[29] << 16)
            | ((uint32_t)e[30] << 8) | (uint32_t)e[31];
    estatus = ((uint32_t)e[32] << 24) | ((uint32_t)e[33] << 16)
            | ((uint32_t)e[34] << 8) | (uint32_t)e[35];

    BRINGUP_LOG("  [ev] type=%lu status=%lu flags=0x%04X\n",
                (unsigned long)etype, (unsigned long)estatus,
                (unsigned)eflags);

