wolfSSL/wolfip/src/port/rp2350_cyw43439/cyw43439_driver.c
    switch (etype) {
    case WLC_E_LINK:
        if ((eflags & WLC_EVENT_MSG_LINK) != 0U) {
            memcpy(g_cyw43.bssid, &e[48], 6);
            g_cyw43.assoc_up = 1;
            g_cyw43.assoc_seen = 1;
        }
        else {
            g_cyw43.assoc_up = 0;
            g_cyw43.keyed = 0;
        }
        break;
    case WLC_E_ASSOC:
        /* ASSOC-success means the 802.11 association completed, but on a
         * WPA2 BSS the port is still UNKEYED here - data sent now is
         * dropped. Track it as link-up for diagnostics, but gate "ready
         * for data" on WLC_E_PSK_SUP (keyed) below, not on this. */
        if (estatus == WLC_E_STATUS_SUCCESS) {
            memcpy(g_cyw43.bssid, &e[48], 6);
            g_cyw43.assoc_up = 1;
            g_cyw43.assoc_seen = 1;
        }
        break;
    case WLC_E_PSK_SUP:
        /* Firmware 4-way supplicant state. KEYED = handshake complete and
         * the link is encrypted: this is the real "join succeeded" signal.
         * Non-keyed boots associate but this never reaches KEYED. */
        if (estatus == WLC_SUP_KEYED) {
            g_cyw43.keyed = 1;
        }
        break;
    case WLC_E_DEAUTH:
    case WLC_E_DEAUTH_IND:
    case WLC_E_DISASSOC:
    case WLC_E_DISASSOC_IND:
        g_cyw43.assoc_up = 0;
        g_cyw43.keyed = 0;
        break;
    default:
        break;
    }
}

int cyw43_connect(const uint8_t *ssid, size_t ssid_len,
                  const uint8_t bssid[6], int channel, int open_auth)
{
    uint8_t  mask[4U + WL_EVENTING_MASK_LEN];
    uint8_t  ssidbuf[WLC_SSID_STRUCT_SZ];
    uint32_t i;
    int      rc;

    (void)channel;
    if (ssid == NULL || ssid_len == 0U || ssid_len > 32U || !g_cyw43.ready) {
        return -1;
    }

    /* Remember the BSSID for EAPOL framing; 0 means learn it from the
     * assoc event source address. */
    if (bssid != NULL) {
        memcpy(g_cyw43.bssid, bssid, 6);
    }
    else {
        memset(g_cyw43.bssid, 0, 6);
    }
    g_cyw43.assoc_up = 0;
    g_cyw43.assoc_seen = 0;
    g_cyw43.keyed = 0;

    /* The host runs the 4-way: disable the firmware's own supplicant. */
    (void)set_iovar_u32("sup_wpa", 0U);

    /* Subscribe to assoc/link/eapol events. The bsscfg:event_msgs value
     * is a 4-byte interface index (0) followed by a 16-byte event mask;
     * event index n sets bit (n & 7) of mask byte (n >> 3). */
    memset(mask, 0, sizeof(mask));
    for (i = 0; i < (uint32_t)sizeof(cyw43_event_subs); i++) {
        mask[4U + (cyw43_event_subs[i] >> 3)] |=
            (uint8_t)(1U << (cyw43_event_subs[i] & 7U));
    }
    (void)set_iovar("bsscfg:event_msgs", mask, sizeof(mask));

    /* Infrastructure, open 802.11 auth (RSN runs above it). */
    (void)cyw43_ioctl_set_u32(WLC_SET_INFRA, INFRA_INFRASTRUCTURE);
    (void)cyw43_ioctl_set_u32(WLC_SET_AUTH, AUTH_OPEN);

    if (open_auth) {
        /* Truly open network: no encryption, no RSN. */
        (void)cyw43_ioctl_set_u32(WLC_SET_WSEC, WSEC_NONE);
        (void)cyw43_ioctl_set_u32(WLC_SET_WPA_AUTH, WPA_AUTH_DISABLED);
    }
    else {
        /* WPA2-PSK / CCMP with the host supplicant doing the 4-way. */
        (void)cyw43_ioctl_set_u32(WLC_SET_WSEC, WSEC_AES_ENABLED);
        (void)cyw43_ioctl_set_u32(WLC_SET_WPA_AUTH, WPA2_AUTH_PSK);
        (void)set_iovar("wpaie", cyw43_rsn_ie_wpa2_psk,
                        (uint32_t)sizeof(cyw43_rsn_ie_wpa2_psk));
    }

    /* Kick off auth + assoc. WLC_SET_SSID payload = wlc_ssid_t. */
    memset(ssidbuf, 0, sizeof(ssidbuf));
    wr32le(&ssidbuf[0], (uint32_t)ssid_len);
    memcpy(&ssidbuf[4], ssid, ssid_len);
    rc = cyw43_ioctl(WLC_SET_SSID, 1, ssidbuf, sizeof(ssidbuf));
    return rc;
}

int cyw43_join_psk(const uint8_t *ssid, size_t ssid_len,
                   const char *passphrase, size_t pass_len)
{
    uint8_t  mask[4U + WL_EVENTING_MASK_LEN];
    uint8_t  pmk[4U + 64U];      /* wsec_pmk_t: key_len(2) flags(2) key[64] */
    uint8_t  ssidbuf[WLC_SSID_STRUCT_SZ];
    uint8_t  cfgval[8];          /* bsscfg iovar: index(4) + value(4)       */
    uint32_t i;
    int      rc;

    if (ssid == NULL || ssid_len == 0U || ssid_len > 32U
        || passphrase == NULL || pass_len == 0U || pass_len > 63U
        || !g_cyw43.ready) {
        return -1;
    }
    memset(g_cyw43.bssid, 0, 6);
    g_cyw43.assoc_up = 0;
    g_cyw43.assoc_seen = 0;
    g_cyw43.keyed = 0;

    /* Take the MAC down before (re)configuring. A fresh interface is
     * already up from cyw43_wifi_up, but on a retry after a non-keyed
     * association the firmware's bsscfg/supplicant state is left wedged - a
     * bare WLC_DISASSOC does not clear it, so every config ioctl then
     * returns BCME_ERROR(-1). WLC_DOWN resets that state; we WLC_UP again
     * just before WLC_SET_SSID. (Ref: cyw43-driver/brcmfmac config is done
     * around an up/down cycle; DISASSOC alone is insufficient.) */
    rc = cyw43_ioctl(WLC_DOWN, 1, 0, 0U);
    BRINGUP_LOG("  [io] down rc=%d\n", rc);

    /* Subscribe to assoc/link/PSK-supplicant events. */
    memset(mask, 0, sizeof(mask));
    for (i = 0; i < (uint32_t)sizeof(cyw43_event_subs); i++) {
        mask[4U + (cyw43_event_subs[i] >> 3)] |=
            (uint8_t)(1U << (cyw43_event_subs[i] & 7U));
    }
    rc = set_iovar("bsscfg:event_msgs", mask, sizeof(mask));
    BRINGUP_LOG("  [io] event_msgs rc=%d\n", rc);

    /* Firmware-offload WPA2-PSK/CCMP: the CYW43439 firmware runs the 4-way
     * itself (host-run PSK is not supported on this FullMAC firmware). We
     * enable the firmware supplicant and push the passphrase; the firmware
     * derives the PMK (PBKDF2) and completes the handshake. */
    rc = cyw43_ioctl_set_u32(WLC_SET_WSEC, WSEC_AES_ENABLED);
    BRINGUP_LOG("  [io] wsec rc=%d\n", rc);

    /* Enable the firmware supplicant. cyw43-driver sets BOTH forms: the
     * bsscfg-prefixed one (4-byte index + value) is what the per-interface
     * 4-way actually keys off. These bsscfg sets are APPLIED by the
     * firmware even though it returns no timely CDC response (they appear
     * to "time out"); without them the link associates but never keys. */
    wr32le(&cfgval[0], 0U);              /* bsscfg index 0 (STA)            */
    wr32le(&cfgval[4], 1U);              /* sup_wpa = 1                     */
    rc = set_iovar("bsscfg:sup_wpa", cfgval, sizeof(cfgval));
    BRINGUP_LOG("  [io] bsscfg:sup_wpa rc=%d\n", rc);
    rc = set_iovar_u32("sup_wpa", 1U);
    BRINGUP_LOG("  [io] sup_wpa rc=%d\n", rc);
    wr32le(&cfgval[4], 0xFFFFFFFFU);     /* sup_wpa2_eapver = -1            */
    (void)set_iovar("bsscfg:sup_wpa2_eapver", cfgval, sizeof(cfgval));
    wr32le(&cfgval[4], 5000U);           /* sup_wpa_tmo = 5000 ms (cyw43)   */
    (void)set_iovar("bsscfg:sup_wpa_tmo", cfgval, sizeof(cfgval));             /* ms */

    busy_loop(50000U);                   /* brief settle (cyw43 waits ~2 ms) */
    memset(pmk, 0, sizeof(pmk));
    pmk[0] = (uint8_t)pass_len;          /* key_len (LE u16)                */
    pmk[1] = (uint8_t)(pass_len >> 8);
    pmk[2] = (uint8_t)WSEC_PASSPHRASE;   /* flags (LE u16) = passphrase     */
    memcpy(&pmk[4], passphrase, pass_len);
    rc = cyw43_ioctl(WLC_SET_WSEC_PMK, 1, pmk, sizeof(pmk));
    /* cyw43_ioctl left the cleartext passphrase in the static g_iobuf; scrub
     * it now rather than waiting for the next ioctl to overwrite it. */
    cyw43_secure_zero(g_iobuf, sizeof(g_iobuf));
    BRINGUP_LOG("  [io] set_pmk rc=%d\n", rc);

    rc = cyw43_ioctl_set_u32(WLC_SET_INFRA, INFRA_INFRASTRUCTURE);
    BRINGUP_LOG("  [io] infra rc=%d\n", rc);
    rc = cyw43_ioctl_set_u32(WLC_SET_AUTH, AUTH_OPEN);
    BRINGUP_LOG("  [io] auth rc=%d\n", rc);
    rc = set_iovar_u32("mfp", 1U);       /* MFP_CAPABLE (cyw43 sets this)   */
    BRINGUP_LOG("  [io] mfp rc=%d\n", rc);
    rc = cyw43_ioctl_set_u32(WLC_SET_WPA_AUTH, WPA2_AUTH_PSK);
    BRINGUP_LOG("  [io] wpa_auth rc=%d\n", rc);

