wolfSSL/wolfip/src/port/rp2350_cyw43439/cyw43439_driver.c
    /* Bring the MAC back up, then let the firmware register the config
     * before association. WLC_SET_SSID triggers the join, so the brief
     * settle here gives the in-firmware supplicant time to latch the PMK -
     * cutting the associate-but-never-key race seen on some boots. */
    rc = cyw43_ioctl(WLC_UP, 1, 0, 0U);
    BRINGUP_LOG("  [io] up rc=%d\n", rc);
    busy_loop(60000U);                   /* ~20 ms settle before SET_SSID    */

    memset(ssidbuf, 0, sizeof(ssidbuf));
    wr32le(&ssidbuf[0], (uint32_t)ssid_len);
    memcpy(&ssidbuf[4], ssid, ssid_len);
    rc = cyw43_ioctl(WLC_SET_SSID, 1, ssidbuf, sizeof(ssidbuf));
    BRINGUP_LOG("  [io] set_ssid rc=%d\n", rc);
    /* Scrub the cleartext passphrase copy (compiler-resistant). */
    cyw43_secure_zero(pmk, sizeof(pmk));
    return rc;
}

int cyw43_disconnect(void)
{
    g_cyw43.assoc_up = 0;
    g_cyw43.keyed = 0;
    return cyw43_ioctl(WLC_DISASSOC, 1, 0, 0U);
}

int cyw43_tx_eapol(const uint8_t *frame, size_t len)
{
    uint8_t hdr[14];

    if (!g_cyw43.ready || frame == NULL) {
        return -1;
    }
    /* Synthesise the 802.3 header: dst = AP, src = STA, type 0x888E. */
    memcpy(&hdr[0], g_cyw43.bssid, 6);
    memcpy(&hdr[6], g_cyw43.mac,   6);
    hdr[12] = (uint8_t)(ETHERTYPE_EAPOL >> 8);
    hdr[13] = (uint8_t)(ETHERTYPE_EAPOL & 0xFFU);
    return bdc_data_tx(hdr, sizeof(hdr), frame, (uint32_t)len);
}

int cyw43_tx_eth(const uint8_t *frame, size_t len)
{
    if (!g_cyw43.ready) {
        return -1;
    }
    /* frame already carries a full Ethernet header. */
    return bdc_data_tx(NULL, 0U, frame, (uint32_t)len);
}

int cyw43_set_key(int kt, uint8_t key_idx, const uint8_t *key, size_t key_len)
{
    int rc;
    if (!g_cyw43.ready || key == NULL || key_len > 32U) {
        return -1;
    }
    memset(g_keybuf, 0, sizeof(g_keybuf));
    wr32le(&g_keybuf[WSEC_KEY_OFF_INDEX], (uint32_t)key_idx);
    wr32le(&g_keybuf[WSEC_KEY_OFF_LEN],   (uint32_t)key_len);
    memcpy(&g_keybuf[WSEC_KEY_OFF_DATA], key, key_len);
    wr32le(&g_keybuf[WSEC_KEY_OFF_ALGO], CRYPTO_ALGO_AES_CCM);
    if (kt == 0) {
        /* Pairwise: primary key, bound to the AP MAC. Refuse to install
         * against a stale/zero BSSID (assoc event missed or bssid was NULL) -
         * the firmware would mis-bind the key to an all-zero address. */
        static const uint8_t zero_mac[6] = { 0, 0, 0, 0, 0, 0 };
        if (!g_cyw43.assoc_seen
            || memcmp(g_cyw43.bssid, zero_mac, 6) == 0) {
            cyw43_secure_zero(g_keybuf, sizeof(g_keybuf));
            return -1;
        }
        wr32le(&g_keybuf[WSEC_KEY_OFF_FLAGS], WL_PRIMARY_KEY);
        memcpy(&g_keybuf[WSEC_KEY_OFF_EA], g_cyw43.bssid, 6);
    }
    /* Group: flags 0, ea = 00:00:00:00:00:00 (already zeroed). */
    rc = cyw43_ioctl(WLC_SET_KEY, 1, g_keybuf, sizeof(g_keybuf));
    /* Scrub the installed temporal key from both static buffers (cyw43_ioctl
     * copied it into g_iobuf), mirroring cyw43_join_psk's passphrase scrub. */
    cyw43_secure_zero(g_keybuf, sizeof(g_keybuf));
    cyw43_secure_zero(g_iobuf,  sizeof(g_iobuf));
    return rc;
}

int cyw43_poll(void)
{
    uint32_t st, rlen, size, doff, paylen;
    uint8_t  chan, hlen;
    uint16_t etype;
    const uint8_t *pay;
    int processed = 0;

    if (!g_cyw43.ready) {
        return 0;
    }

    /* Clear any latched FIFO error first - it gates F2 RX, so an unacked
     * overflow from a prior burst would otherwise keep this poll seeing
     * "no packet" forever (RX stall). */
    gspi_service_irq();

    for (;;) {
        st = gspi_reg_read(GSPI_FUNC_BUS, SPI_STATUS_REGISTER, 0U);
        if (st == 0xFFFFFFFFU || (st & STATUS_F2_PKT_AVAILABLE) == 0U) {
            break;
        }
        rlen = (st & STATUS_F2_PKT_LEN_MASK) >> STATUS_F2_PKT_LEN_SHIFT;
        /* The 4-byte-padded read must fit g_iobuf; reject and abort drain. */
        if (!cyw43_sdpcm_rlen_ok(rlen, CYW43_IOBUF_SZ)) {
            gspi_reg_write(GSPI_FUNC_BACKPLANE, SPI_FRAME_CONTROL, 1U, 1U);
            break;
        }
        f2_read(g_iobuf, rlen);
        /* Validate the SDPCM checksum + declared-vs-actual size. A corrupt
         * frame is already drained by f2_read, so skip it (continue) and keep
         * draining the queued good frames behind it rather than abandon the
         * loop (cf. the matching guards in cyw43_ioctl). */
        if (cyw43_sdpcm_validate(g_iobuf, rlen, &size, &chan) != CYW43_RX_OK) {
            continue;
        }
        sdpcm_update_credit(g_iobuf);     /* refresh TX window from RX */
        hlen = g_iobuf[7];
        if (!cyw43_sdpcm_hlen_ok(hlen, size)) {
            continue;
        }
        processed++;

        if (chan == SDPCM_CHAN_EVENT) {
            cyw43_handle_event(&g_iobuf[hlen], size - hlen);
        }
        else if (chan == SDPCM_CHAN_DATA) {
            /* Validate the BDC data_offset and extract the 802.3 payload
             * (doff becomes the absolute payload offset into g_iobuf). */
            if (cyw43_sdpcm_bdc_payload(g_iobuf, hlen, size,
                                        &doff, &paylen, &etype) != 0) {
                continue;
            }
            pay = &g_iobuf[doff];
            g_cyw43.rx_count++;       /* any inbound data frame = liveness */
            if (etype < 0x0600U) {
                /* 802.3-length / non-Ethernet-II noise (this AP floods
                 * 64-byte type-0x0000 frames). Count for liveness but
                 * drop it - delivering would bury real packets, and the
                 * single-slot wifi.c stage means one per poll. */
                continue;
            }
            BRINGUP_LOG("  [data] ethertype=0x%04X len=%lu\n",
                        (unsigned)etype, (unsigned long)paylen);
            /* The wifi.c RX path stages a SINGLE frame for wolfIP, and both
             * callbacks stage into that same slot. So deliver one frame per
             * poll and return - draining more (EAPOL or data) would overwrite
             * the just-staged frame before wolfIP_poll reads it. */
            if (etype == ETHERTYPE_EAPOL) {
                if (g_cyw43.eapol_cb != NULL) {
                    (void)g_cyw43.eapol_cb(g_cyw43.cb_ctx,
                                           &pay[14], paylen - 14U);
                }
            }
            else if (g_cyw43.data_cb != NULL) {
                (void)g_cyw43.data_cb(g_cyw43.cb_ctx, pay, paylen);
            }
            /* One data frame per poll regardless of whether a callback was
             * registered: the wifi.c RX stage holds a single frame, so
             * draining further frames here would overwrite it. Returning
             * also keeps the "one frame per poll" invariant when a callback
             * is NULL (e.g. before both are registered). */
            return processed;
        }
        /* SDPCM_CHAN_CONTROL here = a stray ioctl response; ignore. */
    }
    return processed;
}

int cyw43_assoc_up(void)
{
    return g_cyw43.assoc_up;
}

/* Diagnostic snapshot of the gSPI RX gates: the F0 status word (0x08, F2
 * packet-available bit 0x100 + length [19:9]) and the latched interrupt
 * register (0x04). Lets the heartbeat distinguish a chip-gated F2 (status
 * shows no packet) from a host that is not draining a flagged packet, and
 * surfaces any stuck error bits. */
void cyw43_rx_diag(uint32_t *status, uint32_t *intr)
{
    if (status != NULL) {
        *status = gspi_reg_read(GSPI_FUNC_BUS, SPI_STATUS_REGISTER, 0U);
    }
    if (intr != NULL) {
        *intr = gspi_reg_read(GSPI_FUNC_BUS, SPI_INTERRUPT_REGISTER, 0U)
                & 0xFFFFU;
    }
}

int cyw43_keyed(void)
{
    return g_cyw43.keyed;
}

int cyw43_get_mac(uint8_t out[6])
{
    if (out == NULL) return -1;
    memcpy(out, g_cyw43.mac, 6);
    return g_cyw43.ready ? 0 : -1;
}

int cyw43_get_bssid(uint8_t out[6])
{
    if (out == NULL) return -1;
    memcpy(out, g_cyw43.bssid, 6);
    /* Valid once the link has come up at least once (the BSSID is latched
     * even if the link then flaps down before the 4-way completes). */
    return g_cyw43.assoc_seen ? 0 : -1;
}

int cyw43_assoc_seen(void)
{
    return g_cyw43.assoc_seen;
}

uint32_t cyw43_rx_count(void)
{
    return g_cyw43.rx_count;
}
